MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK40DN512VLQ10/mcu.h
#define ADSADDR                       0x1FFFFFFF80000000      // ADMA System Address


//*****************************************************************************
//
// The following are defines for the bit fields in the SDHC_VENDOR register.
//
//*****************************************************************************

#define EXBLKNU                       0x00000002      // Exact Block Number Block Read Enable For SDIO CMD53
#define EXTDMAEN                      0x00000001      // External DMA Request Enable


//*****************************************************************************
//
// The following are defines for the bit fields in the SDHC_MMCBOOT register.
//
//*****************************************************************************

#define BOOTBLKCNT                    0x7FFF80000000      // Defines the stop at block gap value of automatic mode. When received card block cnt is equal to BOOTBLKCNT and AUTOSABGEN is 1, then stop at block gap.
#define AUTOSABGEN                    0x00000080      // When boot, enable auto stop at block gap function. This function will be triggered, and host will stop at block gap when received card block cnt is equal to BOOTBLKCNT.
#define BOOTEN                        0x00000040      // Boot Mode Enable
#define BOOTMODE                      0x00000020      // Boot Mode Select
#define BOOTACK                       0x00000010      // Boot Ack Mode Select
#define DTOCVACK                      0x00000078      // Boot ACK Time Out Counter Value


//*****************************************************************************
//
// The following are defines for the bit fields in the SDHC_HOSTVER register.
//
//*****************************************************************************

#define VVN                           0x007F8000      // Vendor Version Number


//*****************************************************************************
//
// The following are defines for the bit fields in the LCD_GCR register.
//
//*****************************************************************************

#define Regulated Voltage Enable      0x80000000      // Enables internal voltage regulator. It must have the charge pump enabled.
#define Regulated Voltage Trim        0x78000000      // This 4-bit trim register is used to adjust the regulated input. Each bit in the register has equal weight. The regulated input is changed by 1.5% for each count.
#define Charge Pump or Resistor Bias Select0x00800000      // Selects the LCD controller charge pump or a resistor network to supply the LCD voltages VLL1, VLL2, and VLL3.
#define High Reference Select         0x00400000      // When using the VIREG inputs, this bit configures internal circuits to supply VLL1.
#define Load Adjust                   0x00600000      // Configures SLCD to handle different LCD glass capacitance.
#define Voltage Supply Control        0x00060000      // Configures whether the LCD controller power supply is external or internal. Avoid modifying this field while the LCD controller is enabled, for example, if LCDEN = 1.
#define LCD Frame Frequency Interrupt Enable0x00008000      // Enables an LCD interrupt event that coincides with the LCD controller frame frequency.
#define LCD Fault Detection Complete Interrupt Enable0x00004000      // Enables an LCD interrupt event when fault detection is completed.
#define LCD Alternate Clock Divider   0x00006000      // Functions as a clock divider to divide the alternate clock before it is selected as LCD clock source.
#define LCD Wait                      0x00000200      // LCD driver, charge pump, resistor bias network, and voltage regulator stop while in Wait mode.
#define LCD Stop                      0x00000100      // LCD driver, charge pump, resistor bias network, and voltage regulator stop while in Stop mode.
#define LCD Driver Enable             0x00000080      // Starts LCD controller waveform generator.
#define LCD Clock Source Select       0x00000040      // The LCD controller has two possible clock sources. This bit is used to select which clock source is the basis for LCD clock.
#define LCD Clock Prescaler           0x000000E0      // Used as a clock divider to generate the SLCD frame frequency. LCD controller duty cycle configuration is used to determine the LCD controller frame frequency. LCD controller frame frequency calculations are provided in SLCD base clock and frame frequency.
#define LCD duty select               0x0000001C      // Selects the duty cycle of the LCD controller driver.


//*****************************************************************************
//
// The following are defines for the bit fields in the LCD_AR register.
//
//*****************************************************************************

#define LCD Frame Frequency Interrupt flag0x00008000      // Indicates a frame frequency interrupt condition has occurred. To clear the interrupt, write 1 to LCDIF.
#define Blink command                 0x00000080      // Starts or stops SLCD blinking.
#define Alternate display mode        0x00000040      // For four back planes or less, the LCD back plane sequencer changes to output an alternate display. ALT bit is ignored if DUTY[2:0] is 101 or greater.
#define Blank display mode            0x00000020      // Asserting this bit clears all segments in the LCD.
#define Blink mode                    0x00000008      // Selects the blink mode displayed during the blink period.
#define Blink-rate configuration      0x0000001C      // Selects frequency at which the LCD blinks when the BLINK bit is asserted. The following equation provides an expression for the LCD controller blink rate and shows how BRATE field is used in the LCD blink-rate calculation.


//*****************************************************************************
//
// The following are defines for the bit fields in the LCD_FDCR register.
//
//*****************************************************************************

#define Fault Detect Clock Prescaler  0x0001C000      // Fault detect sample clock frequency is:
#define Fault Detect Sample Window Width0x00003800      // Specifies the sample window width of fault detection, in number of cycles in the range from 4–512 (Sample window = 4*2^N).
#define Reserved                      0x00000100      // 
#define Fault Detect Enable           0x00000080      // If LCDEN is 1, asserting FDEN inserts a test frame after normal LCD refresh frame is completed. After the test frame is done, Fault detection complete flag (FDCF) is set. When the test frame is done, a normal LCD refresh frame starts. FDEN is one-shot register, it clears after FDCF is set.
#define Fault Detect Back Plane Enable0x00000040      // Enables "back plane" timing for the fault detect circuit. FDBPEN = 0 generates front plane timing. This bit specifies the type of pin selected under fault detect test.
#define Fault Detect Pin ID           0x000007E0      // Specifies the LCD pin to be checked by pullup fault detection.


//*****************************************************************************
//
// The following are defines for the bit fields in the LCD_FDSR register.
//
//*****************************************************************************

#define Fault Detection Complete Flag 0x00008000      // FDCF indicates that the fault detection is completed. Writing 1 to this bit clears it to zero. This bit also acts as an interrupt flag when FDCIEN is set. Software can use either interrupt or polling to check whether one pin fault detection is completed.
#define Reserved                      0x001FC000      // 
#define Fault Detect Counter          0x00007F80      // Contains how many “one/high” are sampled inside the fault detect sample window.


//*****************************************************************************
//
// The following are defines for the bit fields in the LCD_PENn register.
//
//*****************************************************************************

